

txt_A = '''
### 说明:
*  分析七八年级成绩.
*  自动生成分析报表.
'''
txt_B = '''
### 版本更新:
* ###### 2022.10.1,开始学习numpy、pandas。
* ###### 2023.2.1,完成程序设计，必须为9个学科。
* ###### 2023.4.5,用streamlit制作了一个web外壳。
* ###### 2023.4.30,第一次重写代码，自适应若干个学科，不需要必须9个学科了。
* ###### 2023.5.7,添加滑块,确定学科分析的每班参评人数.
* ###### 2023.5.10,对学科名进行排序.
* ###### 2023.5.18,对分析结果调用模板.班级分析全班参与.
* ###### 2023.5.20,自动调用级段模板填充数据.班级分析人数可选.
* ###### 2023.7.29,第二次重写代码,采用了模块化/对像化/函数化技术.
* ###### 2024.7.7,简化一些代码.
* ###### 2024.10.23,正常使用一次月考.
'''
long_text = '''
# 设置所有学科的名称列表。
xk_dic = {"语文": 1, "数学": 2, "英语": 3, "物理": 4, "化学": 5, "生物": 6, "政治": 7, "历史": 8, "地理": 9}

# 设置双达标函数的学科排名与总分排名
R_XK, R_ZF = 260, 260  # 学科排名,总分排名
# 设置双达标的积分值
JF_SDB = [7.5]

# 设置学科分数段.
ls1 = [36, 48, 60, 72, 78, 84, 90, 96, 102, 108, 114, 120]  # 120分数段
ls7 = [21, 28, 35, 42, 45, 49, 52, 56, 60, 63, 66, 70]      # 70分数段
ls5 = [15, 20, 25, 30, 32, 35, 37, 40, 42, 45, 48, 50]      # 50分数段
# 设置学科分数段的积分值.
JF_FSD = [1, 2, 3, 5, 5.5, 6, 6.5, 7.5, 8, 9, 9.5, 10]       # 每个分数段的积分值

# 设置班级名次段
MC_BJ = [0, 10, 50, 100, 150, 200, 250, 300, 350, 400]      # 各个名次段
# 设置班级名次段的积分值
JF_BJ = [10, 9.5, 9, 8.5, 8, 7, 6, 2, 2, 0]                  # 各个名次段的积分

# 成绩报表的xlsx文件.
MB_file = "c:/loongsea/模板2024.xlsx"

'''
from longsea.als import workbook_to_bytesIO
from longsea import als
from openpyxl import load_workbook
import streamlit as st
import pandas as pd
from io import BytesIO
import functools
import time
import os

# ----------------------------------------------------------------------------------------------------------------------
# 设置参数信息
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 设置所有学科的名称列表。
xk_dic = {"语文": 1, "数学": 2, "英语": 3, "物理": 4, "化学": 5, "生物": 6, "政治": 7, "历史": 8, "地理": 9}

# 设置双达标函数的学科排名与总分排名
R_XK, R_ZF = 260, 260  # 学科排名,总分排名
# 设置双达标的积分值
JF_SDB = [7.5]

# 设置学科分数段.
ls1 = [36, 48, 60, 72, 78, 84, 90, 96, 102, 108, 114, 120]  # 120分数段
ls7 = [21, 28, 35, 42, 45, 49, 52, 56, 60, 63, 66, 70]      # 70分数段
ls5 = [15, 20, 25, 30, 32, 35, 37, 40, 42, 45, 48, 50]      # 50分数段
# 设置学科分数段的积分值.
JF_FSD = [1, 2, 3, 5, 5.5, 6, 6.5, 7.5, 8, 9, 9.5, 10]       # 每个分数段的积分值

# 设置班级名次段
MC_BJ = [0, 10, 50, 100, 150, 200, 250, 300, 350, 400]      # 各个名次段
# 设置班级名次段的积分值
JF_BJ = [10, 9.5, 9, 8.5, 8, 7, 6, 2, 2, 0]                  # 各个名次段的积分

# 成绩报表的xlsx文件.
MB_file = "c:/loongsea/模板2024.xlsx"
# MB_file = "./模板2024.xlsx"

# ----------------------------------------------------------------------------------------------------------------------
# 设置页面信息
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 设置网页显示信息
st.set_page_config(page_title="成绩分析_LOONGSEA", page_icon=":bar_chart:",initial_sidebar_state="expanded",)
# 显示主标题
st.markdown(''' ### 成绩分析程序 ''')
st.write("***")
# 添加侧边栏说明文本
st.sidebar.write(txt_A)

# 创建一个上传文件的按钮
uploaded_file = st.file_uploader("上传XLSX文件", type=["xlsx"])
if not uploaded_file:
    st.text_area(label='设置说明', value=long_text, height=570, help=txt_B)
    exit()
elif uploaded_file:
    # 添加两个分列.
    col_A, col_B = st.columns(2)
    # 左分列
    with col_A:
        # 使用Pandas读取己上传的Excel文件
        df = pd.read_excel(uploaded_file, engine='openpyxl', sheet_name=None)      # 读取所有工作表。
        # 创建一个选择框，返回列表中的一个选中的工作表。df.keys(),df的所有工作表名列表
        selected_sheet = st.selectbox("选择工作表", list(df.keys()))
        # 将所选工作表的数据返回df表。
        df = df[selected_sheet]                          # *****************df表为所选工作表学生成绩表***********************
        # 添加一个滑动条,用于选择统计学科成绩时,计算的班级学生数.
        bc_xk = st.slider('选择学科分析范围', min_value=1, max_value=60, value=45)
        # 右分列:
    with col_B:
        # 读取模板文件
        df_MB = pd.read_excel(MB_file, engine='openpyxl', sheet_name=None)
        # 创建选择框，返回其中选中的工作表。
        sht_MB_name = st.selectbox("选择报表模板", list(df_MB.keys()))
        # 添加一个滑动条,用于选择统计学科成绩时,计算的班级学生数.
        bc_bj = st.slider('选择班级分析范围', min_value=1, max_value=60, value=50)


start = time.time()
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 0:读取文件并定义为ana_df对象.
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
#  如果没有上传文件,则退出程序.
if df.empty:
    exit()
# 如查己上传文件,生成为ana_df对象df.
df = als.ana_df(df, xk_dic=xk_dic)
# 获取实有的标准学科名称,如必须为"英语"等.
lst_XKM = df.get_xkm()



# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# A:计算双达标人数,生成双达标报表.目标对象:df_MC,结果对象:df_SDB(双达标报表)
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 获取学科总分名次表,单元格值为学科名次与总分名次组成的元组.
df_MC = df.get_mc(banc=bc_xk)

# 从函数als.ana_sdb定义偏函数SDB_A，设置学科排名xk=200,总分排名zf=200.
SDB_A = functools.partial(als.Fun_sdb, xk=R_XK, zf=R_ZF)
# 创建字典，键值对为{"总分":'count'},统计总分的个数,以得到参评人数。
dic_XKZF = {"总分": 'count'}
# 更新字典，添加键值对为{学科名：双达标函数},以计算双达标人数.
dic_XKZF.update({str(i): SDB_A for i in lst_XKM})    # {"总分": 'count', "语文": SDB_A .......})
# 使用聚合函数,确定参评人数和双达标人数.
df_SDB = df_MC.groupby("班级").agg(dic_XKZF)          # 等价于.agg({"总分": 'count', "语文": SDB_A .......})
# 最终成果:df_SDB.


# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# B1:分数段统计与两率一平.目标对象:df_FSD,结果对象:dfs_xk(各学科的分数段与两率一平报表的列表)
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 对函数als.GFuns_fsd(分类段函数)定义偏函数,分别对应120,70,50三种学科.ls1,ls7,ls5的值在最前的设置中修改.
Fsds1 = functools.partial(als.GFuns_fsd, ls=ls1)()  # 设置偏函数并运行,得到一个统计120分值学科的函数组.
Fsds7 = functools.partial(als.GFuns_fsd, ls=ls7)()  # 设置偏函数并运行,得到一个统计70分值学科的函数组.
Fsds5 = functools.partial(als.GFuns_fsd, ls=ls5)()  # 设置偏函数并运行,得到一个统计50分值学科的函数组.

# 对函数als.GFuns_lv(及格率与优秀率函数)设置偏函数,分别对应120,70,50三种学科.
Lvs1 = functools.partial(als.GFuns_lv, ls=[72, 96, 120])()  # 设置偏函数并运行,得到120学科的及格优秀人数与比率.
Lvs7 = functools.partial(als.GFuns_lv, ls=[42, 56, 70])()  # 设置偏函数并运行,得到70学科的及格优秀人数与比率.
Lvs5 = functools.partial(als.GFuns_lv, ls=[30, 40, 50])()  # 设置偏函数并运行,得到50学科的及格优秀人数与比率.

# 将分数段函数、两率函数、平均分函数捆绑为方案。
Fan1 = [*Fsds1, *Lvs1, "mean"]  # 120分方案
Fan7 = [*Fsds7, *Lvs7, "mean"]  # 70分方案
Fan5 = [*Fsds5, *Lvs5, "mean"]  # 50分方案
# 标准学科名与匹配方案
DFan = {"语文": Fan1, "数学": Fan1, "英语": Fan1, "物理": Fan7, "政治": Fan7, "化学": Fan5, "生物": Fan5, "历史": Fan5, "地理": Fan5}
# 实有学科名与匹配方案(排除了不存在的学科名)
dic_FSD = {i: DFan[i] for i in lst_XKM}

# 获取一个分数段表df_FSD，包括班级，和各个学科的分值。
df_FSD = df.get_df(bas=["班级"], banc=bc_xk)
# 按班级分组后，执行分数组函数与两率一平计算。生成一个报表.
df_FSD = df_FSD.groupby("班级").agg(dic_FSD)
# 按列标(学科)拆分分数段分析表为多个学科的分析报表,然后组成一个列表list_xk.
dfs_xk = als.df_split(df_FSD)

# st.write(dfs_xk[0])
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# B2:为分数段两率一平表添加积分列/排名列.目标对象:dfs_xk,结果对象:dfs_xk.
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 双达标积分表+分数段的积分表
JF_FSD_SDB = JF_SDB + JF_FSD
# 为积分函数设置偏好值,将积分权重值先行加入.
JF = functools.partial(als.Fun_jf, qz=JF_FSD_SDB)  # 设置偏函数,预先设置qz的值为JF_FSD_SDB.

# 为学科分析报表的每个学科报表添加新列.
for xkm, dff in zip(lst_XKM, dfs_xk):
    # 添加双达标列.
    dff.insert(loc=0, column=('统计', "双达标"), value=df_SDB[xkm])
    # 添加积分列
    dff.insert(loc=0, column=('统计', "积分"), value=dff.iloc[:, 0:(len(JF_FSD_SDB))].apply(JF, axis=1))
    # 添加排名列.
    dff.insert(loc=1, column=('统计', "排名"), value=dff[("统计", "积分")].rank(axis=0, ascending=False, method="min"))
    # 添加参评人数列
    dff.insert(loc=0, column=('统计', "人数"), value=df_SDB["总分"])


# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# C:计算班级成绩,统计班级名次段情况.目标对象:df_BJ.结果对象:df_BJ.
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 为名次段函数设置偏函数并运行(缺省值为名次表,不累计计数),生成统计名次段的函数组的列表.
MC_FunS_0 = functools.partial(als.GFunS_mcd, ls=MC_BJ, lj=0)()  # 设置偏函数,不累计计数.
MC_FunS_1 = functools.partial(als.GFunS_mcd, ls=MC_BJ, lj=1)()  # 设置偏函数,累计计数.
# 为积分函数设置偏好值置为班级积分表:JF_b
BJF = functools.partial(als.Fun_jf, qz=JF_BJ)

# 创建班级表，只包括班级列与总分列，班级用来分组，总分用来应用名次段函数。
df_BJ = df.get_df(bas=["班级"], xk=0, count=["级次"], banc=bc_bj)  # 包括班级列/学科列/级次列.
# 用班级分组，用总分应用名次段函数,count函数用于统计数据总个数。
df_BJ = df_BJ.groupby("班级")["级次"].agg(["count", *MC_FunS_0, *MC_FunS_1])
# 插入积分列。
df_BJ.insert(loc=1, column="积分", value=df_BJ.iloc[:, 1:(len(MC_BJ) + 1)].apply(BJF, axis=1))  # 添加积分列
# 插入名次列。
df_BJ.insert(loc=2, column="排名", value=df_BJ["积分"].rank(axis=0, ascending=False, method="min"))  # 添加积分排名列

# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# D:选择模板文件ws,并针分析数据注入工作表ws中.目标对象:df_BJ,dfs_xk.
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 打开模板文件。
wb = load_workbook(MB_file)  # 模板文件.
# 删除无关工作表,并保存工作簿与工作表,
wb,ws = als.retain_worksheet(wb,sht_MB_name)


# 将班级分析数据注入ws表中。
als.dfs_to_ws(ws,133,4,[df_BJ])
# 将学科分析表的列表注入ws表.
als.dfs_to_ws(ws,5,4,dfs_xk,16,0)
# 将wb封装为一个二进行的BytisIO文件.
down_file=workbook_to_bytesIO(wb)

# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# E:添加一个下载按钮
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
# 添加时间信息。
st.success(f"运算己经完成，共用时：{round(time.time() - start, 2)}秒。")
# 创建下载按钮,以便下载此工作簿
st.download_button(icon = "📜",
    label='下载分析结果',
    data=down_file,
    file_name=os.path.splitext(uploaded_file.name)[0] + "_" + sht_MB_name + "_报表" + ".xlsx",
    mime='application/vnd.openxmlformats-officedocument.spreadsheetml.sheet')